[
    {
      "job_title": "Software Engineer",
      "company": "Tech Innovations Inc.",
      "location": {
        "country": "USA",
        "city": "San Francisco"
      },
      "description": "We are looking for a passionate Software Engineer to design, develop, and install software solutions. Requirements: 3+ years of experience in software development, strong knowledge of JavaScript, React, and Node.js. This is a mid-level role requiring problem-solving skills and knowledge of modern development tools.",
      "job_url": "https://www.example.com/software-engineer"
    },
    {
      "job_title": "Data Scientist",
      "company": "Data Analytics Corp.",
      "location": {
        "country": "Canada",
        "city": "Toronto"
      },
      "description": "Seeking a Data Scientist to analyze complex data and deliver business insights. Requirements: 5+ years of experience, expertise in Python, R, and machine learning frameworks. Senior-level role; experience with big data technologies like Hadoop is a plus.",
      "job_url": "https://www.example.com/data-scientist"
    },
    {
      "job_title": "Digital Marketing Specialist",
      "company": "MarketMasters LLC",
      "location": {
        "country": "UK",
        "city": "London"
      },
      "description": "We need a creative Digital Marketing Specialist to manage our campaigns. Requirements: 2+ years of experience in social media, SEO, and PPC campaigns. Junior to mid-level role, strong knowledge of Google Analytics is essential.",
      "job_url": "https://www.example.com/digital-marketing-specialist"
    },
    {
      "job_title": "Project Manager",
      "company": "BuildRight Construction",
      "location": {
        "country": "USA",
        "city": "New York"
      },
      "description": "We are hiring a Project Manager to oversee construction projects. Requirements: 7+ years of experience, PMP certification preferred. Senior-level role requiring leadership skills and proficiency in MS Project.",
      "job_url": "https://www.example.com/project-manager"
    },
    {
      "job_title": "Graphic Designer",
      "company": "Creative Minds Studio",
      "location": {
        "country": "Australia",
        "city": "Sydney"
      },
      "description": "Looking for a Graphic Designer to create visual concepts. Requirements: 3+ years of experience, proficiency in Adobe Creative Suite, and a strong portfolio. Mid-level role; knowledge of motion graphics is a bonus.",
      "job_url": "https://www.example.com/graphic-designer"
    },
    {
      "job_title": "Cybersecurity Analyst",
      "company": "SecureIT Solutions",
      "location": {
        "country": "USA",
        "city": "Austin"
      },
      "description": "Join our team as a Cybersecurity Analyst to protect our systems. Requirements: 4+ years of experience, knowledge of threat modeling, SIEM tools, and cybersecurity certifications like CISSP or CEH. Mid-level role with opportunities for growth.",
      "job_url": "https://www.example.com/cybersecurity-analyst"
    },
    {
      "job_title": "HR Manager",
      "company": "Global Enterprises Ltd.",
      "location": {
        "country": "Germany",
        "city": "Berlin"
      },
      "description": "Seeking an experienced HR Manager to lead our HR department. Requirements: 6+ years of experience, expertise in employee relations, and knowledge of German labor laws. Senior-level role requiring excellent communication skills.",
      "job_url": "https://www.example.com/hr-manager"
    },
    {
      "job_title": "Financial Analyst",
      "company": "FinanceWorks Inc.",
      "location": {
        "country": "USA",
        "city": "Chicago"
      },
      "description": "We are hiring a Financial Analyst to assess financial data and trends. Requirements: 3+ years of experience, a degree in Finance or Economics, and advanced Excel skills. Mid-level role; CFA certification is a plus.",
      "job_url": "https://www.example.com/financial-analyst"
    },
    {
      "job_title": "Mechanical Engineer",
      "company": "Innovative Machines Ltd.",
      "location": {
        "country": "India",
        "city": "Bangalore"
      },
      "description": "Looking for a Mechanical Engineer to design and oversee machinery production. Requirements: 5+ years of experience, knowledge of AutoCAD and SolidWorks. Senior-level role requiring strong technical expertise.",
      "job_url": "https://www.example.com/mechanical-engineer"
    },
    {
      "job_title": "Content Writer",
      "company": "Storyline Media",
      "location": {
        "country": "UK",
        "city": "Manchester"
      },
      "description": "Hiring a Content Writer to create engaging articles and blogs. Requirements: 2+ years of experience, excellent writing skills, and knowledge of SEO best practices. Junior-level role with opportunities for creativity.",
      "job_url": "https://www.example.com/content-writer"
    },
    {
      "job_title": "AI Research Scientist",
      "company": "AI Pioneers Lab",
      "location": {
        "country": "USA",
        "city": "Boston"
      },
      "description": "Seeking an AI Research Scientist to develop innovative AI solutions. Requirements: PhD in AI or related field, 5+ years of research experience, and expertise in deep learning frameworks. Senior-level role with a focus on research and development.",
      "job_url": "https://www.example.com/ai-research-scientist"
    },
    {
      "job_title": "Customer Service Representative",
      "company": "FriendlyCo",
      "location": {
        "country": "Philippines",
        "city": "Manila"
      },
      "description": "Looking for a Customer Service Representative to handle customer inquiries. Requirements: 1+ year of experience in customer service, excellent communication skills, and a friendly attitude. Junior-level role with on-the-job training provided.",
      "job_url": "https://www.example.com/customer-service-representative"
    },
    {
      "job_title": "Electrician",
      "company": "BrightElectric Inc.",
      "location": {
        "country": "USA",
        "city": "Houston"
      },
      "description": "Hiring an experienced Electrician for residential and commercial projects. Requirements: 5+ years of experience, a valid electrician license, and knowledge of safety regulations. Mid-level role with opportunities for overtime.",
      "job_url": "https://www.example.com/electrician"
    },
    {
      "job_title": "Web Developer",
      "company": "CodeCrafters",
      "location": {
        "country": "India",
        "city": "Mumbai"
      },
      "description": "Join us as a Web Developer to build responsive websites. Requirements: 3+ years of experience, expertise in HTML, CSS, JavaScript, and knowledge of WordPress. Mid-level role; familiarity with Vue.js or Angular is a bonus.",
      "job_url": "https://www.example.com/web-developer"
    },
    {
      "job_title": "Architect",
      "company": "Design Studio Inc.",
      "location": {
        "country": "France",
        "city": "Paris"
      },
      "description": "We need an Architect to design innovative buildings. Requirements: 7+ years of experience, a degree in Architecture, and proficiency in Revit and AutoCAD. Senior-level role with creative freedom.",
      "job_url": "https://www.example.com/architect"
    },
    {
        "job_title": "UX Designer",
        "company": "PixelCraft Studio",
        "location": {
          "country": "USA",
          "city": "Seattle"
        },
        "description": "We are looking for a UX Designer to enhance user experiences across our digital products. Requirements: 4+ years of experience in UX design, proficiency in Figma and Adobe XD, and a strong portfolio showcasing user-centered design. Mid-level role.",
        "job_url": "https://www.example.com/ux-designer"
      },
      {
        "job_title": "Sales Manager",
        "company": "Global Sales Ltd.",
        "location": {
          "country": "South Africa",
          "city": "Cape Town"
        },
        "description": "Hiring a Sales Manager to lead our regional sales team. Requirements: 6+ years of experience in sales, proven leadership skills, and a strong track record of meeting sales targets. Senior-level role.",
        "job_url": "https://www.example.com/sales-manager"
      },
      {
        "job_title": "Cloud Engineer",
        "company": "CloudGen Solutions",
        "location": {
          "country": "Canada",
          "city": "Vancouver"
        },
        "description": "Seeking a Cloud Engineer to develop and maintain cloud infrastructure. Requirements: 5+ years of experience, expertise in AWS or Azure, and knowledge of Kubernetes and Docker. Senior-level role.",
        "job_url": "https://www.example.com/cloud-engineer"
      },
      {
        "job_title": "Nurse Practitioner",
        "company": "CareHealth Clinic",
        "location": {
          "country": "Australia",
          "city": "Melbourne"
        },
        "description": "We are hiring a Nurse Practitioner to provide primary healthcare services. Requirements: 5+ years of experience, a valid nursing license, and excellent patient care skills. Mid to senior-level role.",
        "job_url": "https://www.example.com/nurse-practitioner"
      },
      {
        "job_title": "Business Analyst",
        "company": "SolutionsCorp",
        "location": {
          "country": "USA",
          "city": "San Diego"
        },
        "description": "Looking for a Business Analyst to identify business needs and solutions. Requirements: 3+ years of experience, strong analytical skills, and proficiency in business process modeling. Mid-level role.",
        "job_url": "https://www.example.com/business-analyst"
      },
      {
        "job_title": "Civil Engineer",
        "company": "BuildPro Ltd.",
        "location": {
          "country": "UK",
          "city": "Birmingham"
        },
        "description": "Join us as a Civil Engineer to design infrastructure projects. Requirements: 5+ years of experience, knowledge of structural analysis software, and a degree in Civil Engineering. Senior-level role.",
        "job_url": "https://www.example.com/civil-engineer"
      },
      {
        "job_title": "Operations Manager",
        "company": "EfficientOps Inc.",
        "location": {
          "country": "USA",
          "city": "Dallas"
        },
        "description": "Hiring an Operations Manager to streamline business processes. Requirements: 6+ years of experience, strong organizational skills, and expertise in logistics and supply chain management. Senior-level role.",
        "job_url": "https://www.example.com/operations-manager"
      },
      {
        "job_title": "Product Manager",
        "company": "InnovateTech",
        "location": {
          "country": "India",
          "city": "Hyderabad"
        },
        "description": "Seeking a Product Manager to oversee product development. Requirements: 5+ years of experience, expertise in Agile methodologies, and strong communication skills. Senior-level role.",
        "job_url": "https://www.example.com/product-manager"
      },
      {
        "job_title": "Social Media Manager",
        "company": "ViralSocials",
        "location": {
          "country": "Brazil",
          "city": "Rio de Janeiro"
        },
        "description": "Looking for a Social Media Manager to create and manage social campaigns. Requirements: 3+ years of experience, creativity, and strong knowledge of social media platforms. Mid-level role.",
        "job_url": "https://www.example.com/social-media-manager"
      },
      {
        "job_title": "Machine Learning Engineer",
        "company": "AIWorks Ltd.",
        "location": {
          "country": "Singapore",
          "city": "Singapore"
        },
        "description": "We need a Machine Learning Engineer to develop AI models. Requirements: 5+ years of experience in Python, TensorFlow, and PyTorch. Senior-level role with opportunities to work on cutting-edge AI projects.",
        "job_url": "https://www.example.com/machine-learning-engineer"
      },
      {
        "job_title": "Legal Advisor",
        "company": "LawSolutions",
        "location": {
          "country": "UK",
          "city": "Edinburgh"
        },
        "description": "Hiring a Legal Advisor to provide legal counsel on business matters. Requirements: 7+ years of experience, expertise in corporate law, and a valid license to practice law. Senior-level role.",
        "job_url": "https://www.example.com/legal-advisor"
      },
      {
        "job_title": "Interior Designer",
        "company": "DreamSpaces Inc.",
        "location": {
          "country": "UAE",
          "city": "Dubai"
        },
        "description": "Seeking an Interior Designer to create stylish interiors. Requirements: 4+ years of experience, a degree in Interior Design, and proficiency in design software. Mid-level role.",
        "job_url": "https://www.example.com/interior-designer"
      },
      {
        "job_title": "Pharmacist",
        "company": "HealthPlus Pharmacy",
        "location": {
          "country": "USA",
          "city": "Orlando"
        },
        "description": "Looking for a licensed Pharmacist to manage prescriptions and advise patients. Requirements: 5+ years of experience, a Pharm.D. degree, and a valid pharmacist license. Senior-level role.",
        "job_url": "https://www.example.com/pharmacist"
      },
      {
        "job_title": "Backend Developer",
        "company": "CodeFlow Inc.",
        "location": {
          "country": "Germany",
          "city": "Munich"
        },
        "description": "We need a Backend Developer to build scalable APIs. Requirements: 4+ years of experience in Python or Java, knowledge of SQL databases, and familiarity with cloud services. Mid-level role.",
        "job_url": "https://www.example.com/backend-developer"
      },
      {
        "job_title": "IT Support Specialist",
        "company": "HelpDesk Heroes",
        "location": {
          "country": "USA",
          "city": "Atlanta"
        },
        "description": "Hiring an IT Support Specialist to assist users with technical issues. Requirements: 2+ years of experience in IT support, knowledge of Windows and MacOS, and excellent troubleshooting skills. Junior to mid-level role.",
        "job_url": "https://www.example.com/it-support-specialist"
      },
      {
        "job_title": "Junior Developer (React-Native & Cloud)",
        "company": "SebCompany",
        "location": {
                "country": "Romania",
                "city": "Timisoara"
              },
        "description": "We're seeking an experienced React-Native Engineer. Experienced in developing applications, good with teamwork and multitasking. Also Cloud Expertise is a plus, if he knows Docker, Redis. Experience with english language and passionate to learn. It is a Junior role, so if he is still pursuing his Bachelors degree it is perfect.",
        "job_url": "https://www.example.com/junior-react-native-cloud"
      }
]
  